In [1]:
import pandas as pd

In [4]:
import sqlalchemy

In [37]:
engine=sqlalchemy.create_engine('mysql+pymysql://root:ppass@123@localhost:3306/custorder')
#HERE you can pass the database name then select the table

In [38]:
#Format of connecting mysql database
#mysql+pymysql://username:password@host:port/database_name
#find format to connect other data bases
#https://pandas.pydata.org/pandas-docs/stable/io.html#engine-connection-examples

In [43]:
query='''SELECT * FROM customers'''
df=pd.read_sql_query(query, engine)
#whatever the data bases are there they are showing then mention that data base in engine then use
#that data base and then select the table for doing operation

In [42]:
df.head()

   id first_name last_name             email
0   1        Boy    George  george@gmail.com
1   2     George   Michael      gm@gmail.com
2   3      David     Bowie   david@gmail.com
3   4       Blue    Steele    blue@gmail.com
4   5      Bette     Davis     bette@aol.com

In [44]:
#use query and read table method to read the table and executing the query there

In [47]:
pd.read_sql(query,engine)
#this wrapper of the both things reading the table and executing the query with the help of engine

   id first_name last_name             email
0   1        Boy    George  george@gmail.com
1   2     George   Michael      gm@gmail.com
2   3      David     Bowie   david@gmail.com
3   4       Blue    Steele    blue@gmail.com
4   5      Bette     Davis     bette@aol.com

In [48]:
pd.read_sql_table('customers',engine)
#same we did using sql query

   id first_name last_name             email
0   1        Boy    George  george@gmail.com
1   2     George   Michael      gm@gmail.com
2   3      David     Bowie   david@gmail.com
3   4       Blue    Steele    blue@gmail.com
4   5      Bette     Davis     bette@aol.com

In [50]:
pd.read_sql('customers',engine)
#the same thing we did here using read_sql which is wrapper of table and query

   id first_name last_name             email
0   1        Boy    George  george@gmail.com
1   2     George   Michael      gm@gmail.com
2   3      David     Bowie   david@gmail.com
3   4       Blue    Steele    blue@gmail.com
4   5      Bette     Davis     bette@aol.com